<script setup>
    // إستيراد الحزم والوحدات الضرورية
    import { Head, Link } from "@inertiajs/vue3";
    import Layout from "@/Layouts/Layout.vue";
</script>

<template>
    <div class="container mx-auto">
        <Head title="Terms And Conditions" />
        <Layout>
            <main>
                <h1>شروط وأحكام الاستخدام</h1>
    <p>مرحبًا بكم في <a href="http://mzaodin.com/">http://mzaodin.com/</a>، يرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام خدماتنا. باستخدام هذا الموقع، فإنك توافق على الالتزام بالشروط والأحكام التالية. إذا لم توافق على هذه الشروط، يرجى عدم استخدام الموقع.</p>
    <h2>الاستخدام المسموح به:</h2>
    <ul>
        <li>يحق للأفراد استخدام الموقع للوصول إلى المحتوى المتاح والتفاعل معه بموجب هذه الشروط.</li>
        <li>يجب على المستخدمين الامتناع عن استخدام الموقع بطريقة تنتهك حقوق الآخرين أو تعرض سمعة الموقع للضرر.</li>
    </ul>
    <h2>حقوق الملكية الفكرية:</h2>
    <ul>
        <li>يعتبر جميع المحتوى المتاح على <a href="http://mzaodin.com/">http://mzaodin.com/</a> مملوكًا لنا أو مرخصًا لنا ومحميًا بموجب قوانين حقوق الملكية الفكرية.</li>
        <li>يمنع نسخ أو توزيع أو استخدام أي محتوى من دون إذن مسبق منا.</li>
    </ul>
    <h2>سياسة الخصوصية:</h2>
    <ul>
        <li>نحن نلتزم بحماية خصوصية مستخدمينا وجمع المعلومات بموجب سياسة الخصوصية الخاصة بنا.</li>
        <li>يرجى قراءة سياسة الخصوصية لفهم كيفية جمع واستخدام المعلومات الشخصية.</li>
    </ul>
    <h2>التعديلات على الشروط والأحكام:</h2>
    <ul>
        <li>نحتفظ بالحق في تعديل هذه الشروط والأحكام في أي وقت دون إشعار مسبق.</li>
        <li>يتوجب على المستخدمين مراجعة هذه الشروط بشكل دوري للتأكد من التزامهم بها.</li>
    </ul>
    <h2>تحديد المسؤولية:</h2>
    <ul>
        <li>نحن غير مسؤولين عن أي أضرار مباشرة أو غير مباشرة ناتجة عن استخدام الموقع.</li>
        <li>يتم استخدام الموقع على مسؤولية المستخدم الشخصية.</li>
    </ul>
    <p>باستخدامك لهذا الموقع، فإنك توافق على هذه الشروط والأحكام بالكامل.</p>
    <p>تاريخ آخر تحديث: يناير 2024.</p>
            </main>
        </Layout>
    </div>
</template>

<style scoped>
    /* أسلوب التنسيق CSS */
    main {
        line-height: 1.6;
        direction: rtl;
        text-align: right;
        padding: 20px;
    }
    main h1 {
        text-align: center;
    }
    main ul {
        list-style-type: none;
        padding: 0;
    }
    main ul li {
        margin-bottom: 10px;
    }
</style>
